#!/usr/bin/env python3
"""
Тестирование потокового анализа ТЗ
"""

import sys
import os

# Добавляем текущую директорию в путь
sys.path.append('.')

# Создаем mock handler для тестирования
class MockHandler:
    def __init__(self):
        from api_main import TestAPIHandler
        self.handler = TestAPIHandler(None, None, None)
    
    def test_small_tz(self):
        """Тестируем маленькое ТЗ (меньше 500 символов)"""
        print("🧪 ТЕСТ 1: Маленькое ТЗ")
        print("=" * 50)
        
        text = """Краткое ТЗ:
1. Создать систему
2. Добавить пользователей
3. Настроить права доступа"""
        
        print(f"Длина текста: {len(text)} символов")
        result = self.handler.stream_text_analysis(text, "test_small")
        print(f"Результат: {len(result.get('model_actions', []))} действий")
        return result
    
    def test_medium_tz(self):
        """Тестируем среднее ТЗ (несколько абзацев)"""
        print("\n🧪 ТЕСТ 2: Среднее ТЗ")
        print("=" * 50)
        
        with open("test_tz.txt", "r", encoding="utf-8") as f:
            text = f.read()
        
        print(f"Длина текста: {len(text)} символов")
        result = self.handler.stream_text_analysis(text, "test_medium")
        print(f"Результат: {len(result.get('model_actions', []))} действий")
        return result
    
    def test_large_tz(self):
        """Тестируем большое ТЗ (разбитое на чанки)"""
        print("\n🧪 ТЕСТ 3: Большое ТЗ")
        print("=" * 50)
        
        with open("large_tz.txt", "r", encoding="utf-8") as f:
            text = f.read()
        
        print(f"Длина текста: {len(text)} символов")
        result = self.handler.stream_text_analysis(text, "test_large")
        print(f"Результат: {len(result.get('model_actions', []))} действий")
        
        # Проверяем, создался ли файл
        if os.path.exists("models/test_large.json"):
            print(f"✅ Файл модели создан: models/test_large.json")
            with open("models/test_large.json", "r", encoding="utf-8") as f:
                model = f.read()
            print(f"📏 Размер файла: {len(model)} символов")
        
        return result
    
    def test_chunk_logic(self):
        """Тестируем логику разбиения на чанки"""
        print("\n🧪 ТЕСТ 4: Логика разбиения на чанки")
        print("=" * 50)
        
        # Создаем текст с явными разделами
        text = """ГЛАВА 1. Введение
        
        Это введение содержит менее 500 символов.
        Оно должно объединиться со следующей главой.
        
        ГЛАВА 2. Основные требования
        
        Этот раздел уже содержит более 500 символов. 
        Он должен обрабатываться отдельным чанком.
        Здесь много текста для заполнения пространства.
        Нужно достичь минимального размера чанка.
        Продолжаем добавлять текст для тестирования.
        Еще немного текста для объема.
        И еще немного для полной уверенности.
        Теперь точно должно хватить символов.
        
        ГЛАВА 3. Заключение
        
        Короткое заключение."""
        
        print(f"Длина текста: {len(text)} символов")
        print("\nОжидаемое поведение:")
        print("1. Глава 1 (маленькая) объединится с Главой 2")
        print("2. Глава 2 обработается как отдельный чанк")
        print("3. Глава 3 обработается как последний чанк")
        
        result = self.handler.stream_text_analysis(text, "test_chunks")
        return result

if __name__ == "__main__":
    # Создаем папку models если ее нет
    if not os.path.exists("models"):
        os.makedirs("models")
        print("📁 Создана папка models")
    
    tester = MockHandler()
    
    print("🚀 ЗАПУСК ТЕСТОВ ПОТОКОВОГО АНАЛИЗА ТЗ")
    print("=" * 60)
    
    # Запускаем тесты
    try:
        tester.test_small_tz()
        tester.test_medium_tz()
        tester.test_large_tz()
        tester.test_chunk_logic()
        
        print("\n" + "=" * 60)
        print("✅ ВСЕ ТЕСТЫ ЗАВЕРШЕНЫ!")
        print("\n📁 Проверьте папку models/:")
        for file in os.listdir("models"):
            if file.endswith(".json"):
                size = os.path.getsize(f"models/{file}")
                print(f"   - {file} ({size} байт)")
        
    except Exception as e:
        print(f"❌ Ошибка при тестировании: {e}")
        import traceback
        traceback.print_exc()